<?php
// +----------------------------------------------------------------------
// | Author: Orzice(小涛)
// +----------------------------------------------------------------------
// | 联系我: https://i.orzice.com
// +----------------------------------------------------------------------
// | gitee: https://gitee.com/orzice
// +----------------------------------------------------------------------
// | github: https://github.com/orzice
// +----------------------------------------------------------------------
// | DateTime: 2021-07-06 16:46:02
// +----------------------------------------------------------------------

return [
    // 版本
    'version'         => '1.0.0',
    // 日期
    'release'         => '2021070601',
    // Session配置
    'SessionName'         => 'orzice_api:',
    // 后台管理员密码加密
    'pwSDK'         => env('orziceapi.pwSDK', ''),
    // 前台用户密码加密
    'userPW'         => env('orziceapi.userPW', ''),
    // 云平台配置
    'CloudUrl'         => 'https://cloud.orzice.com',
    //  后台访问目录 可以进行更改！
    'Admin'         => 'admin',
    //  唯一ID 勿动
    'uniqueid'         => '',
    //  服务器公网IP
    'ServerIp'         => '',
];
